[MID_CreditsIntro_TSS]
[eng]
Congratulations!

Here you are, at the presumed end of Beethro's travels in the Great Beneath.  First of all, we thank you for playing our game.  If you are relatively new to DROD, then we thank you for giving it a try.  And, hey, looks like you persevered to the end!  That means you are determined and, in our humble opinion, made of sterner stuff than most gamers.

If you are a hard-core fan, we thank you for faithfully sticking with us through many the years we worked to enhance and expand on the original DROD formula.  It took us a long time to tell the story of Beethro, and you have stuck with us.  Now you know most everything you've been waiting all these years to find out, and we hope you enjoyed the journey.

Hopefully, you saved everyone on the surface you could.  If not, now's the time to restore back to before Beethro's final campsite and take some more time to help take care of everyone else.  There's a lot of optional game content in there!  It's fit for anyone looking for some true DROD-style puzzle challenges, as if the core game content wasn't hard enough.

And now, the credits...

This was our most ambitious project to date, so you're going to see mention of a lot of individuals here.  Many wore multiple hats, so it's hard to provide due acknowledgment to all that individuals contributed without writing volumes.

So!  You can use the arrow keys to speed up or slow down the scrolling, and space to pause.

[MID_ErikH_C_TSS]
[eng]
Creator, Concept, Story, Art

[MID_ErikH_Text_TSS]
[eng]
Erik wrote the original core story for TSS.  As the father of DROD, Erik gets an honorary spot at the top of the credits.  None of this would have happened without him and many others that came before.  As you might guess, Erik had Beethro's entire story in mind from the beginning.  If you've played through the earlier DROD games, we hope that you can appreciate the flawlessly consistent story threads we wove together from the very beginning to set up the backstory for TSS.  We're grateful Erik stuck around to help us finish up the adventure.  He also created many of the colorful characters and all of the portrait art that you see in TSS.  Thank you, Erik, for this unique gaming experience that we could take and run with in TSS!

[MID_MikeR_C_TSS]
[eng]
Producer, Lead Programmer, Level Design, Art Direction, Voice and Testing Coordination, Sound Effects and Voice Editing

[MID_MikeR_Text_TSS]
[eng]
I'm writing these credits, so I guess I get to toot my own horn here.  Looking back, most all I can think of now is that it was a lot of work.  Keeping a niche indie franchise like DROD going for over a decade required a will of iron!  But here we are, at the end of an era.  I'm glad we made it.  If you liked the game, and your life is a bit richer for the experience, then it was all worth it.

I'd like to give a very special thanks to my wonderful wife, Olga, and my children, who very patiently waited while their husband and father spent many years delving the beneath. Without their support, this game would not have been possible.

Now that Beethro's story has been told, it's time for me to move on to other things.  But before that, I'm going to move on to praise everyone else that worked on TSS.  Without each and every one of them, not only would this project not have reached its full potential, but we very likely never would have reached this point.  So the kudos goes to you all.

[MID_MattS_C_TSS]
[eng]
CaravelNet Design and Programming

[MID_MattS_Text_TSS]
[eng]
Just like me, Matt has stuck around with Caravel from the beginning.  It's a good thing too, because the CaravelNet functionality and the goodness that goes into the Caravel Forum belongs to Matt.  This magic enables a community to be built around an intrinsically single player game.  Thank you, Matt, for always caring.

[MID_JacobG_C_TSS]
[eng]
Holdmaster, Level design, Story, Scripting

[MID_JacobG_Text_TSS]
[eng]
Jacob is a master architect who, over the years, has created so much of the core goodness that we know as DROD.  He crafted many, many excellent rooms.  He is so good at providing puzzles based on any concept and of any difficulty level.  Jacob spent tireless weeks scripting and integrating all of the hold content produced by the team into the game.  Acting as "holdmaster" was a mammoth job, and the team unanimously decided that in order for things to be done right, Jacob was the man for the job.

[MID_TerenceF_C_TSS]
[eng]
Programming, Game Element Design, Level design, Story, Scripting, Continuity

[MID_TerenceF_Text_TSS]
[eng]
Terence is a wizard of puzzle design and storytelling in the Eighth.  He put together many of the game's masterfully related cutscenes.  He also developed and enhanced many of the core game elements in TSS.  He has an intimate knowledge of the game logic, and through his insights, we were able to flesh out the finer details of how everything works.  He also produced some great puzzle levels, making sure that nothing in the way of emerging puzzle potential was overlooked.  Terence also shared many great ideas for improving our production values that made their way into the game.  Thank you, Terence.

[MID_LarryM_C_TSS]
[eng]
Level design, Game Element Design

[MID_LarryM_Text_TSS]
[eng]
Larry is another wizard of puzzle design.  He created many of the more challenging levels in the game.  Many will agree with me that Larry's puzzle designs are excellent in their elegance as well as in their brain-burning qualities.  Long live Larry and his puzzles!

[MID_LevelDesigners_TSS]
[eng]
Tomi Maksa
Kalle Leppala
Seth Rimer
Neil Frederick
Adam Peterson

[MID_LevelDesigners_C_TSS]
[eng]
Level designers

[MID_LevelDesigners_Text_TSS]
[eng]
In addition to the abovementioned folks, an excellent team of veteran puzzle creators came together to create so much beautiful and challenging puzzle content for TSS, as well as wonderfully artistic locales for Beethro's travels.  Tomi in particular transformed many of our more stark puzzle levels into living, breathing locales.  This team also contributed many wonderful ideas and scripting for the story.  So much of what TSS is would not have come about without their involvement.  Just look at the amount of varied puzzle content in this game!  Since when have you seen a game, indie or otherwise, with this much creative material?  I cannot overstate how much I appreciate them.

[MID_MaurycyZ_C_TSS]
[eng]
Development

[MID_MaurycyZ_Text_TSS]
[eng]
Maurycy helped with TSS development, implementing some new game features that became fundamental to the game.  Tangentially, he also built the online version of "Flash DROD" single-handedly and has been keeping it going while we worked on TSS.  I mention this here to acknowledge his passionate contribution to DROD, putting forth this evidence that he is one of the great DROD evangelists out there!

[MID_AlexK_C_TSS]
[eng]
Art, Sprites and Illustration

[MID_AlexK_Text_TSS]
[eng]
Aleksander was invited to work on TSS art and illustration through Maurycy.  It's a good thing they're friends, because Alex's involvement in TSS is one of the best things that happened to it.  Practically all of the beautiful in-game art and visual upgrades you see here, including the new and upgraded room styles, as well as the TSS logo and CD cover, are thanks to Alex.  He effortlessly adopted our unique visual style and enhanced it in many ways.  For this hardcore puzzle franchise that prizes substance over style, Alex's work has suddenly become the star of the show.  If you're ever looking for a game illustrator, I cannot recommend Alex highly enough.

[MID_GrahamB_C_TSS]
[eng]
Storysmithing

[MID_GrahamB_Text_TSS]
[eng]
Graham joined the TSS team early on to help write the story.  It was a tall order.  He wrote nearly all of the fun and engaging level intro texts in TSS.  He excellently filled this difficult role, conjuring up a new depth to DROD's story canon from nothing.  His masterful "pottery shard" method of learning about the world of the Eighth and the Underground Empire was a brilliant idea!

[MID_JonS_C_TSS]
[eng]
Level Music

[MID_JonS_Text_TSS]
[eng]
This is now the third DROD game that Jon has generously composed music for.  In TSS, he provided the hours of beautiful background music you hear in the Badlands, Caldera and Greenhouse areas.  He also took Erik's "In a Vat" tune to put together this wonderfully whimsical arrangement you now hear playing in the credits.  His work has become an intrinsic part of the DROD experience.

[MID_EmmettP_C_TSS]
[eng]
Title and Thematic Music

[MID_EmmettP_Text_TSS]
[eng]
After writing much of the beautiful music you can hear in "DROD RPG", Emmett returned to write a new collection of wonderfully thematic music for TSS.  His work has definitely cranked the DROD experience up a notch.

[MID_GerryJ_C_TSS]
[eng]
Linux port

[MID_GerryJ_Text_TSS]
[eng]
Gerry also stuck around since near Caravel's beginning to provide our Linux builds and provide good input into the series' production values.  We are grateful for his involvement, bringing DROD to all you penguins out there!

[MID_VoiceTalent_Text_TSS]
[eng]
In addition to TSS having a lot of puzzle content, it also has a lot of story content.  An entire platoon of professional and amateur voice actors, new and old, came together to make the TSS narrative shine.  Like a Beatles reunion, we were blessed to have all of our original actors reprise their roles.  Thank you, everyone, for your contribution!

Michael Abbott - Pit Thing, Tendry, King Dugan, Bruntchief, Jebowdly/First Watcher
Steve Anderson - Hallholder Bombus Gadhan, Patrons
Valentine Andreev - Narrations, Conductor, Citizens
Spring Atkinson - The Critic
Mariah Erlick - Ebby
Erik Hermansen - Arky, Guards, Spogey
Karl Horton - Narrations
Sean Hunt - Halph
Lillian MacLeod - Qwenna, Narration
Jonathan Parkin - Narration
Tony Porter - A1, Guardian, Abovegrounders
Daniel Pugh - First Chemist, Cairos, Narrations, Conductor, Stalwart
Michael S. Repton - Narrations
Brian Richardson - Truth Vessels
John W. Rogers, Jr. - Construct, Conductor, Narrations
Sten Ryason - Beethro
Chase Samuelson - Narrations
Adrienne E. Siskind - Occasio
Clayton Weiss - First Librarian
Johannah West - Farrow Child
Logan West - Engineers, Narrations, Gribbles, Inspector, Citizens, Guards

[MID_Testers_TSS]
[eng]
Banjooie
Ryan Berry
Graham Blatz
Tom Brouws
Jason Mayeaux
Kieran Millar
Daniel Pugh
Michael S. Repton
Seth Rimer
Adrienne E. Siskind

[MID_Testers_Text_TSS]
[eng]
At any chance given to me, I will brag about our testers.  They investigate every nook and cranny in the game to root out any and all imperfections.  As a DROD tester, not only do you need to be able to test software, but you need to be able to solve all these challenging puzzles!  Thank you, everyone, for helping us get TSS out the door.

[MID_CreditsLastWords_TSS]
[eng]
Now that you've completed TSS, as is usual with our games, if you are able to find and complete all the secret rooms (not necessarily in the same playthrough), then you will be rewarded with some additional bonus material from the development team.  Keep at it, and don't be shy asking for hints on the Caravel Forum!

Again, we all thank you for playing.

-Mike

[MID_CreditsTheEnd_TSS]
[eng]
The Second Sky

(c) 2014, 2016 Caravel Games, LLC
www.caravelgames.com
